## Aturan Penulisan Pada Python

In [1]:
#contoh
print("Hello By")

Hello By

In [3]:
print("Hari ini saya sedang belajar data science \ndi Multimatics")

Hari ini saya sedang belajar data science
di Multimatics

In [9]:
nama = "Debby"
usia = 28
alamat = "Jakarta"

print("Nama :",nama)
print("Usia :",usia)
print("Alamat :",alamat)

Nama : Debby
Usia : 28
Alamat : Jakarta

In [10]:
panjang = 10
lebar = 5
luas = panjang * lebar
print("Luas Persegi :", luas)

Luas Persegi : 50

## Statement yang ada di dalam atau di apit oleh tanda kurung sepert [],(),{}

In [11]:
# kurung siku untuk list
# kurung biasa untuk tuple
# kurung kurawal untuk dictionary

nama_hari = ["Senin", "Selasa", "Rabu", "Kamis", "Jum'at"]
print(nama_hari)

['Senin', 'Selasa', 'Rabu', 'Kamis', "Jum'at"]

In [13]:
(nama_hari)

['Senin', 'Selasa', 'Rabu', 'Kamis', "Jum'at"]

In [14]:
nama
alamat
{'Nama':nama, "Alamat": alamat}

{'Nama': 'Debby', 'Alamat': 'Jakarta'}

In [16]:
data = pd.read_csv("namafile")
data

data.info
data.dtypes

NameError: name 'pd' is not defined

In [18]:
nilai = 65
lulus = "Lulus"
gagal = "Tidak Lulus"

if nilai > 65:
    print(lulus)
else:
    print(gagal)

Tidak Lulus

## Statement Looping

In [25]:
nilai = [1,2,3,4,5,6]
for x in nilai:
    print("Nilai =",x)

Nilai = 1
Nilai = 2
Nilai = 3
Nilai = 4
Nilai = 5
Nilai = 6

In [26]:
i = 1
while i < 6:
    print(i)
    i += 1

1
2
3
4
5

In [33]:
# contoh perulangan menggunakan range
for x in range(5, 15, 2):
    print("Perulangan ke", x)

Range 5
Range 7
Range 9
Range 11
Range 13

## Statement Function

In [38]:
def luaspersegi(p,l):
    luas = p * l
    print(luas)
luaspersegi(3,4)

12

## Menggunakan Library Python

In [40]:
# pandas untuk dataframe
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [41]:
A = np.array([1,2,3,4])
A

array([1, 2, 3, 4])

In [42]:
A.shape

(4,)

In [45]:
datauser = pd.read_pickle("users_data_cleaned.pickle")
datauser

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,None,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,None,False,1995-08-01,mobile
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45211,a218c1d6-880a-4431-a314-a1bd3dc36b21,2.0,825.0,51,technician,married,tertiary,False,False,False,cellular,977,3,-1,0,None,True,2002-12-28,desktop
45212,6a6bf402-9416-4e71-97c6-727e8298a3a5,4.0,1729.0,71,retired,divorced,primary,False,False,False,cellular,456,2,-1,0,None,True,2010-11-18,desktop
45213,be32ba96-b178-4b54-b32a-f75b714793df,2.0,5715.0,72,retired,married,secondary,False,False,False,cellular,1127,5,184,3,success,True,1996-06-18,mobile
45214,44623a48-4e9b-48fd-b155-a17d1c06a754,NaN,NaN,57,blue-collar,married,secondary,False,False,False,telephone,508,4,-1,0,None,False,1996-09-14,desktop
45215,5905741c-3f30-416f-8ee5-71abad035de6,3.0,2971.0,37,entrepreneur,married,secondary,False,False,False,cellular,361,2,188,11,other,False,1994-04-28,mobile

In [47]:
datauser.head()

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,None,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,None,False,1995-08-01,mobile

In [48]:
# shape melihat total row dan kolom/atribut
datauser.shape

(45209, 19)

In [50]:
datauser.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45209 entries, 0 to 45215
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   user_id              45209 non-null  object
 1   number_transactions  35210 non-null  float64
 2   total_amount_usd     35210 non-null  float64
 3   age                  45209 non-null  int64
 4   job                  44921 non-null  object
 5   marital              45209 non-null  object
 6   education            43352 non-null  object
 7   default              45209 non-null  bool
 8   housing              45209 non-null  bool
 9   loan                 45209 non-null  bool
 10  contact              32191 non-null  object
 11  duration             45209 non-null  int64
 12  campaign             45209 non-null  int64
 13  pdays                45209 non-null  int64
 14  previous             45209 non-null  int64
 15  poutcome             8252 non-null   object
 16  term_deposit         45209 non-null  bool
 17  date_joined          45179 non-null  datetime64[ns]
 18  device               45115 non-null  object
dtypes: bool(4), datetime64[ns](1), float64(2), int64(5), object(7)
memory usage: 5.7+ MB